{"id":235,"date":"2024-07-25T12:25:01","date_gmt":"2024-07-25T12:25:01","guid":{"rendered":"https:\/\/eziemi.co\/?post_type=product&#038;p=235"},"modified":"2024-07-26T03:31:00","modified_gmt":"2024-07-26T03:31:00","slug":"rama-banquet","status":"publish","type":"product","link":"https:\/\/eziemi.co\/product\/rama-banquet\/","title":{"rendered":"Rama Banquet"},"content":{"rendered":"<p><strong>Facilities and Capacity<\/strong><\/p>\n<p>Rama Banquet is designed to hold a meeting of any shape or size in the city. Their banquet hall can easily accommodate a guest list of 2000 people at a time. This venue offers just the perfect facilities for your functions like valet parking, furniture, basic lighting, electricity, and backup so that while you are commencing your ceremonies you aren&#8217;t troubled by any end time shortage or requirements. The elegant guest rooms come equipped with a range of modern amenities so that you will feel completely relaxed.<\/p>\n<p>A highly experienced and friendly team will be available to help you with all the decisions that you need to make. Their wedding package includes the services of in-house catering, in-house decor, bridal room, service staff and exclusive space for special events. Their staff is quite helpful and dedicated and takes care of all the arrangements so that you can enjoy your happy occasions with all your near and dear ones, without any hassle. Rama Banquet has an enormous amount of facilities, everything you could ever need for a wedding venue.<\/p>\n<p><strong>Services Offered<\/strong><\/p>\n<p>Rama Banquet has a team of amazing chefs who use fresh and healthy ingredients while cooking and fulfil all your desires to serve you the food of your preference. They offer a plethora of mouth-watering cuisines which will spoil you for choice. Come find out why they have such a fantastic reputation for choosing it for your big occasion and trusting it for the same and there is a surety to it that you won&#8217;t regret your decision later rather would find it worth your money and time.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Rama Banquet is an ideal venue in Noida to have weddings or any social festivities. The venue offers state-of-the-art meeting facilities to accommodate an impressive guest list and a fully-equipped event space with professional secretarial services to cater to the needs of the client. Are you looking for your ideal wedding venue which matches up your criteria? Your search ends here as this venue could be one of the dream venues you were thinking of for your wedding celebrations. It is one of the premium places to get married in India.<\/p>\n","protected":false},"featured_media":236,"template":"","meta":[],"product_cat":[32],"product_tag":[],"class_list":{"0":"post-235","1":"product","2":"type-product","3":"status-publish","4":"has-post-thumbnail","6":"product_cat-marriage-loan","8":"first","9":"instock","10":"shipping-taxable","11":"product-type-simple"},"_links":{"self":[{"href":"https:\/\/eziemi.co\/wp-json\/wp\/v2\/product\/235"}],"collection":[{"href":"https:\/\/eziemi.co\/wp-json\/wp\/v2\/product"}],"about":[{"href":"https:\/\/eziemi.co\/wp-json\/wp\/v2\/types\/product"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/eziemi.co\/wp-json\/wp\/v2\/media\/236"}],"wp:attachment":[{"href":"https:\/\/eziemi.co\/wp-json\/wp\/v2\/media?parent=235"}],"wp:term":[{"taxonomy":"product_cat","embeddable":true,"href":"https:\/\/eziemi.co\/wp-json\/wp\/v2\/product_cat?post=235"},{"taxonomy":"product_tag","embeddable":true,"href":"https:\/\/eziemi.co\/wp-json\/wp\/v2\/product_tag?post=235"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}